krr.org
* 战斗系统与外部交互： 进入与退出
   
  - 在战斗系统外部， 通过 [[file:BattleMain.html][BattleMain]] 与 游戏app交互 (根据用户指令进入，根据战斗系统结束状态销毁)
  - 最终 [[file:BattleMain.html::6][BattleMain.Update() 变成 BattleSystem.SystemUpdate() ]]
  - 在战斗系统内部， 通过 BattleSystem 不断的状态更新，内部不同状态跳转 以及 用户指令的输入 使得 BattleSystem.SystemUpdate() 根据系统状态进行不同的工作

所以虽然战斗系统只是整个游戏的一部分，如果我们只关注战斗系统的话，可以把它想象成这样无限循环一个单独运转的程序：

 :  ---用户输入  --->  BattleSystem.SystemUpdate() ---> 用户输入 ---


* BattleSystem: 运行

   BattleSystem 运行设计跟  [[file:BattleMain.html][BattleMain]] 一脉相承, 即使初始化也是通过 SystemUpdate()来完成. 他们主要通过三个状态参数来实现来回跳转: ~e_Mode~, ~ePrepareStep~, ~eMainStep~. 

** BattleSystem.SystemUpdate() 
    它根据 ~e_Mode~ 行动。
    ~e_Mode~ 有这四种状态： Prepare, BattleMain, BattleFinished, Destroy。
    - Prepare会调用 [[*~BattleSystem.Update_Prepare()~][~BattleSystem.Update_Prepare()~]], 它负责准备进入每一波怪时的准备工作,准备完了就改状态为 BattleMain
    - BattleMain会调用 [[*~BattleSystem.Update_Main()~][ ~BattleSystem.Update_Main()~]]， 他负责所有准备完毕到这一波怪杀完或者战斗结束（杀完所有波怪或者自己死光并且不课石头）中间所有事情，所以显然他会不断检查战斗是否结束或者这波怪打完了没有
    - 只有当BattleMain判定为游戏结束时会改状态为BattleFinished，然后就在这里空循环，等待上层控制去 Destroy

:  --- Prepare ---> BattleMain ---> Prepare (下一波怪) ---> BattleMain  ... ----> BattleFinished ---> Destroy    

** ~BattleSystem.Update_Prepare()~
    它负责准备进入每一波怪时的准备工作.
    它根据 ePrepareStep 行动。
    ePrepareStep 有这四种主要状态：First, ~Prepare_0~, ~Prepare_1~, End
    
    - First 分两步:
      
      1. 当这是首次进入战斗时， 它会初始化我方阵营，敌方阵营全部人员，kirara技能， 设置默认参数（自动化，战斗速度等等），进入第二步
      2. 当这是准备下一波怪时，直接跳到这一步， 把我方阵营设置为敌方阵营的 Target （guess why no need to require the reversal setup） 进入 ~Prepare_0~
	 
    - ~Prepare_0~: 更新敌我双方阵营人员信息， 进入 ~Prepare_1~
    - ~Prepare_1~: 更新UI 进入 End
      
    - End: 更新人物技能名字， 开始计算画面中所有人行动速度，绘制行动条，调整画面视角，同时记录现在是第几波怪， 最终跳转到 [[*~BattleSystem.Update_Main()~][ ~BattleSystem.Update_Main()~]]

:    ---> First ---> Prepare_0 --->  Prepare_1 ---> End ---> BattleSystem.Update_Main()-->
 
** ~BattleSystem.Update_Main()~
    
    他负责所有准备完毕到这一波怪杀完或者战斗结束（杀完所有波怪或者自己死光并且不课石头）中间所有事情.
    它根据 eMainStep 行动。
    eMainStep 的具体状态太多，很多状态分 ~X_01~ , ~X_02~, 这样分主要是为了等待上一步完成， 我们将它归纳了一下:

    - eMainStep.First :: 播放WARNNING一闪而过的画面，绘制每个人物（储存到内存里），如果需要就绘制跳到下一波的渐进画面,
                         ,绘制每个人物血条状态条, 跳转至eMainStep.OrderCheck


    - eMainStep.OrderCheck :: 这个是最被反复循环的一个状态
      + 更新行动条，技能cd，从晕眩状态解除， 查看能否一起放珍藏等等工作。 (this.TurnStartProcess())
      + 如果是该行动的是人物，则进入 eMainStep.TurnSkipCheck
      + 如果是该行动的是Card，则进入 CommandExecute

    - eMainStep.TurnSkipCheck :: 看看本次人物的操作是跳过去还是等待用户命令
      + 如果晕眩，睡眠，瘫痪， 放一些动画然后 跳转到本轮操作结束: eMainStep.TurnEnd (虽然并不是直接跳转，但是会到这一步，记住这里是简介)
      + 否则等待用户命令 跳转到 eMainStep.CommandInputStartCheck 

    - eMainStep.CommandInputStartCheck :: 这个是等待并把不同用户指令导入到各自状态中的状态
      + 准备好 ~m_InputData.Result~
      + 如果这个是行动命令, 跳转到 CommandExecute
      + 如果进入板凳选择，实现换人功能，重新跳转到 eMainStep.CommandInputStartCheck 等待指令
      + 如果这个是奇拉垃技能，那么就产生技能效果(ExecMasterSkill())，播放技能动画， 重新跳转到 eMainStep.CommandInputStartCheck 等待指令
      + 如果是一起放珍藏，效果根据需要打开选择珍藏页面，退回，选择顺序， 绘制一起跳的画面，跳转到 ~eMainStep.TogetherAttackExecute_0~ 

    - ~eMainStep.TogetherAttackExecute_0~ :: 一次珍藏效果实现与动画播放
      + 产生珍藏buff，珍藏产生的战斗结果 ExecTogetherAttackOfTurnOwner()
      + 计算伤害和回复，因为要画到动画里
      + 放动画 跳转到 PostCommandExecute， 并在这里反复互跳直到所有人珍藏放完 (敌人死完的话就跳过)

    - eMainStep.CommandExecute :: 执行单次攻击，回复，技能，珍藏命令 
      + 如果是珍藏，产生珍藏buff(ExecTogetherAttackOfTurnOwner()),
      + 单人攻击 ExecCommandOfTurnOwner();
      + 技能: this.ExecSkillCard();
      + 跳转到 PostCommandExecute

    - eMainStep.PostCommandExecute :: 清理本轮技能并且检查战斗状态
      + 清理 PostAfterExecCommand(~this.m_ExecCommand.SolveResult~); 谁死了啊，更新一下各自状态啊，然后放放相应变化的动画
      + 如果多人珍藏没放完，跳到 ~eMainStep.TogetherAttackExecute_0~ 继续放
      + 如果发现画面上有死人， 把替补换上来， 继续跳转到 eMainStep.PostCommandExecute继续检查
      + 最后跳转到 eMainStep.StunExecute， 检查有人被晕了没有

    - eMainStep.StunExecute :: 检查被晕眩的处置
      + 检查谁被晕了 (this.StunCheckProcess())
      + 如果有人晕 更新那些人的状态 (StunOccurProcess() -> StunApplyProcess() ->  StunApplyPostProcess())
      + 跳到 eMainStep.TurnEnd

    - eMainStep.TurnEnd :: 本轮结束收尾检查
      + 检查己方是否全死完(gameover)，如果是，打开是否要课石头重试一次，回复己方所有状态，往下检查，如果不是 跳转到 eMainStep.ToResult
      + 检查是否胜利，如果是, 播放动画， 跳转到 eMainStep.ToResult，如果不是，往下检查
      + 检查这一波怪是否打完，如果是播放动画， 跳到 ~Update_Prepare().Prepare_End~, 准备下一波怪
      + 如果检查s都不是，跳转到下一个行动周期： eMainStep.OrderCheck

    - eMainStep.ToResult :: 战斗结束
      + 返回 eMode.BattleFinished 使 SystemUpdate 进入空循环

本轮人物被晕眩
:    ---> First ---> OrderCheck --->  TurnSkipCheck ---> TurnEnd ---> OrderCheck --> ... --> ToResult

本轮人物放技能
:    ---> First ---> OrderCheck --->  TurnSkipCheck ---> CommandInputStartCheck ---> CommandExecute ---> PostCommandExecute --> StunCheck---> TurnEnd ----> OrderCheck --> ... --> ToResult   

本轮人物放多人珍藏

:    ---> First ---> OrderCheck --->  TurnSkipCheck ---> CommandInputStartCheck ---> TogetherAttackExecute_0 ---> PostCommandExecute --> TogetherAttackExecute_0 ---> PostCommandExecute --> StunCheck---> TurnEnd ----> OrderCheck --> ... --> ToResult   

    

* BattleSystem: 实现

