krr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>krr</title>
<!-- 2018-06-08 五 15:43 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="yuanchuan cao" />
</head>
<body>
<div id="content">
<h1 class="title">krr</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 战斗系统与外部交互： 进入与退出</a></li>
<li><a href="#sec-2">2. BattleSystem: 运行</a>
<ul>
<li><a href="#sec-2-1">2.1. BattleSystem.SystemUpdate()</a></li>
<li><a href="#sec-2-2">2.2. <code>BattleSystem.Update_Prepare()</code></a></li>
<li><a href="#sec-2-3">2.3. <code>BattleSystem.Update_Main()</code></a></li>
</ul>
</li>
<li><a href="#sec-3">3. BattleSystem: 实现</a>
<ul>
<li><a href="#sec-3-1">3.1. 它应该有的样子，和它实际的样子</a></li>
<li><a href="#sec-3-2">3.2. 约定俗成</a></li>
<li><a href="#sec-3-3">3.3. 人物.CharacterHandler</a></li>
<li><a href="#sec-3-4">3.4. 组队.BattlePartyData</a></li>
<li><a href="#sec-3-5">3.5. 行动条.BattleOrder</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1. 被调用的时机 (只考虑改变行动条的情形)</a></li>
<li><a href="#sec-3-5-2">3.5.2. 行动条的结构</a></li>
<li><a href="#sec-3-5-3">3.5.3. 行动条的基本设定</a></li>
<li><a href="#sec-3-5-4">3.5.4. 行动值的计算公式</a></li>
<li><a href="#sec-3-5-5">3.5.5. 初始化时的行动值计算</a></li>
<li><a href="#sec-3-5-6">3.5.6. 单次命令的行动条变化</a></li>
<li><a href="#sec-3-5-7">3.5.7. 集体珍藏的行动条变化</a></li>
<li><a href="#sec-3-5-8">3.5.8. 敌方普通人遭到晕眩 <code>BattleCommandParser.UpdateOrderOnStun(BattleOrder battleOrder)</code></a></li>
<li><a href="#sec-3-5-9">3.5.9. 敌方弱者遭到晕眩</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6. 伤害状态计算与绘制.SkillActionPlayer</a></li>
<li><a href="#sec-3-7">3.7. AI的实现.BattleAIParser</a>
<ul>
<li><a href="#sec-3-7-1">3.7.1. 概览</a></li>
<li><a href="#sec-3-7-2">3.7.2. 被调用的时机</a></li>
<li><a href="#sec-3-7-3">3.7.3. 返回的结果.BattleAISolveResult</a></li>
<li><a href="#sec-3-7-4">3.7.4. 确定释放什么技能.SolveBattleAI</a></li>
<li><a href="#sec-3-7-5">3.7.5. 施放对象的构建</a></li>
<li><a href="#sec-3-7-6">3.7.6. 状态仇恨的计算.CalcHitSingleConditionCount</a></li>
<li><a href="#sec-3-7-7">3.7.7. 单体(target)伤害仇恨的计算.BattleAIParser.SolveTargetJoin</a></li>
<li><a href="#sec-3-7-8">3.7.8. 单体仇恨与仇恨排序.BattleAIHateResult</a></li>
<li><a href="#sec-3-7-9">3.7.9. 确定该技能释放的对象.SolveTargetJoinFromHateResults</a></li>
</ul>
</li>
<li><a href="#sec-3-8">3.8. 实现.BattleSystem</a></li>
<li><a href="#sec-3-9">3.9. 不会怎么提的数据导入.BattleSystemData</a></li>
<li><a href="#sec-3-10">3.10. 不会怎么提的人机交互.BattleInputData</a></li>
<li><a href="#sec-3-11">3.11. 不会怎么提的多媒体效果实现.XScene</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 战斗系统与外部交互： 进入与退出</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>在战斗系统外部， 通过 <a href="BattleMain.html">BattleMain</a> 与 游戏app交互 (根据用户指令进入，根据战斗系统结束状态销毁)
</li>
<li>最终 <a href="BattleMain.html">BattleMain.Update() 变成 BattleSystem.SystemUpdate() </a>
</li>
<li>在战斗系统内部， 通过 BattleSystem 不断的状态更新，内部不同状态跳转 以及 用户指令的输入 使得 BattleSystem.SystemUpdate() 根据系统状态进行不同的工作
</li>
</ul>

<p>
所以虽然战斗系统只是整个游戏的一部分，如果我们只关注战斗系统的话，可以把它想象成这样无限循环一个单独运转的程序：
</p>

<pre class="example">
---用户输入  ---&gt;  BattleSystem.SystemUpdate() ---&gt; 用户输入 ---
</pre>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> BattleSystem: 运行</h2>
<div class="outline-text-2" id="text-2">
<p>
BattleSystem 运行设计跟  <a href="BattleMain.html">BattleMain</a> 一脉相承, 即使初始化也是通过 SystemUpdate()来完成. 他们主要通过三个状态参数来实现来回跳转: <code>e_Mode</code>, <code>ePrepareStep</code>, <code>eMainStep</code>. 
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> BattleSystem.SystemUpdate()</h3>
<div class="outline-text-3" id="text-2-1">
<p>
它根据 <code>e_Mode</code> 行动。
<code>e_Mode</code> 有这四种状态： Prepare, BattleMain, BattleFinished, Destroy。
</p>
<ul class="org-ul">
<li>Prepare会调用 <a href="#sec-2-2"><code>BattleSystem.Update_Prepare()</code></a>, 它负责准备进入每一波怪时的准备工作,准备完了就改状态为 BattleMain
</li>
<li>BattleMain会调用 <a href="#sec-2-3"> <code>BattleSystem.Update_Main()</code></a>， 他负责所有准备完毕到这一波怪杀完或者战斗结束（杀完所有波怪或者自己死光并且不课石头）中间所有事情，所以显然他会不断检查战斗是否结束或者这波怪打完了没有
</li>
<li>只有当BattleMain判定为游戏结束时会改状态为BattleFinished，然后就在这里空循环，等待上层控制去 Destroy
</li>
</ul>

<pre class="example">
--- Prepare ---&gt; BattleMain ---&gt; Prepare (下一波怪) ---&gt; BattleMain  ... ----&gt; BattleFinished ---&gt; Destroy    
</pre>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <code>BattleSystem.Update_Prepare()</code></h3>
<div class="outline-text-3" id="text-2-2">
<p>
它负责准备进入每一波怪时的准备工作.
它根据 ePrepareStep 行动。
ePrepareStep 有这四种主要状态：First, <code>Prepare_0</code>, <code>Prepare_1</code>, End
</p>

<ul class="org-ul">
<li>First 分两步:

<ol class="org-ol">
<li>当这是首次进入战斗时， 它会初始化我方阵营，敌方阵营全部人员，kirara技能， 设置默认参数（自动化，战斗速度等等），进入第二步
</li>
<li>当这是准备下一波怪时，直接跳到这一步， 把我方阵营设置为敌方阵营的 Target （guess why no need to require the reversal setup） 进入 <code>Prepare_0</code>
</li>
</ol>
</li>

<li><code>Prepare_0</code>: 更新敌我双方阵营人员信息， 进入 <code>Prepare_1</code>
</li>
<li><code>Prepare_1</code>: 更新UI 进入 End
</li>

<li>End: 更新人物技能名字， 开始计算画面中所有人行动速度，绘制行动条，调整画面视角，同时记录现在是第几波怪， 最终跳转到 <a href="#sec-2-3"> <code>BattleSystem.Update_Main()</code></a>
</li>
</ul>

<pre class="example">
---&gt; First ---&gt; Prepare_0 ---&gt;  Prepare_1 ---&gt; End ---&gt; BattleSystem.Update_Main()--&gt;
</pre>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <code>BattleSystem.Update_Main()</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
他负责所有准备完毕到这一波怪杀完或者战斗结束（杀完所有波怪或者自己死光并且不课石头）中间所有事情.
它根据 eMainStep 行动。
eMainStep 的具体状态太多，很多状态分 <code>X_01</code> , <code>X_02</code>, 这样分主要是为了等待上一步完成， 我们将它归纳了一下:
</p>

<dl class="org-dl">
<dt> eMainStep.First </dt><dd>播放WARNNING一闪而过的画面，绘制每个人物（储存到内存里），如果需要就绘制跳到下一波的渐进画面,
,绘制每个人物血条状态条, 跳转至eMainStep.OrderCheck
</dd>
</dl>


<dl class="org-dl">
<dt> eMainStep.OrderCheck </dt><dd>这个是最被反复循环的一个状态
<ul class="org-ul">
<li>更新行动条，技能cd，从晕眩状态解除， 查看能否一起放珍藏等等工作。 (this.TurnStartProcess())
</li>
<li>如果是该行动的是人物，则进入 eMainStep.TurnSkipCheck
</li>
<li>如果是该行动的是Card，则进入 CommandExecute
</li>
</ul>
</dd>

<dt> eMainStep.TurnSkipCheck </dt><dd>看看本次人物的操作是跳过去还是等待用户命令
<ul class="org-ul">
<li>如果晕眩，睡眠，瘫痪， 放一些动画然后 跳转到本轮操作结束: eMainStep.TurnEnd (虽然并不是直接跳转，但是会到这一步，记住这里是简介)
</li>
<li>否则等待用户命令 跳转到 eMainStep.CommandInputStartCheck 
</li>
</ul>
</dd>

<dt> eMainStep.CommandInputStartCheck </dt><dd>这个是等待并把不同用户指令导入到各自状态中的状态
<ul class="org-ul">
<li>准备好 <code>m_InputData.Result</code>
</li>
<li>如果这个是行动命令, 跳转到 CommandExecute
</li>
<li>如果进入板凳选择，实现换人功能，重新跳转到 eMainStep.CommandInputStartCheck 等待指令
</li>
<li>如果这个是奇拉垃技能，那么就产生技能效果(ExecMasterSkill())，播放技能动画， 重新跳转到 eMainStep.CommandInputStartCheck 等待指令
</li>
<li>如果是一起放珍藏，效果根据需要打开选择珍藏页面，退回，选择顺序， 绘制一起跳的画面，跳转到 <code>eMainStep.TogetherAttackExecute_0</code> 
</li>
</ul>
</dd>

<dt> <code>eMainStep.TogetherAttackExecute_0</code> </dt><dd>一次珍藏效果实现与动画播放
<ul class="org-ul">
<li>产生珍藏buff，珍藏产生的战斗结果 ExecTogetherAttackOfTurnOwner()
</li>
<li>计算伤害和回复，因为要画到动画里
</li>
<li>放动画 跳转到 PostCommandExecute， 并在这里反复互跳直到所有人珍藏放完 (敌人死完的话就跳过)
</li>
</ul>
</dd>

<dt> eMainStep.CommandExecute </dt><dd>执行单次攻击，回复，技能，珍藏命令 
<ul class="org-ul">
<li>如果是珍藏，产生珍藏buff(ExecTogetherAttackOfTurnOwner()),
</li>
<li>单人攻击 ExecCommandOfTurnOwner();
</li>
<li>技能: this.ExecSkillCard();
</li>
<li>跳转到 PostCommandExecute
</li>
</ul>
</dd>

<dt> eMainStep.PostCommandExecute </dt><dd>清理本轮技能并且检查战斗状态
<ul class="org-ul">
<li>清理 PostAfterExecCommand(<code>this.m_ExecCommand.SolveResult</code>); 谁死了啊，更新一下各自状态啊，然后放放相应变化的动画
</li>
<li>如果多人珍藏没放完，跳到 <code>eMainStep.TogetherAttackExecute_0</code> 继续放
</li>
<li>如果发现画面上有死人， 把替补换上来， 继续跳转到 eMainStep.PostCommandExecute继续检查
</li>
<li>最后跳转到 eMainStep.StunExecute， 检查有人被晕了没有
</li>
</ul>
</dd>

<dt> eMainStep.StunExecute </dt><dd>检查被晕眩的处置
<ul class="org-ul">
<li>检查谁被晕了 (this.StunCheckProcess())
</li>
<li>如果有人晕 更新那些人的状态 (StunOccurProcess() -&gt; StunApplyProcess() -&gt;  StunApplyPostProcess())
</li>
<li>跳到 eMainStep.TurnEnd
</li>
</ul>
</dd>

<dt> eMainStep.TurnEnd </dt><dd>本轮结束收尾检查
<ul class="org-ul">
<li>检查己方是否全死完(gameover)，如果是，打开是否要课石头重试一次，回复己方所有状态，往下检查，如果不是 跳转到 eMainStep.ToResult
</li>
<li>检查是否胜利，如果是, 播放动画， 跳转到 eMainStep.ToResult，如果不是，往下检查
</li>
<li>检查这一波怪是否打完，如果是播放动画， 跳到 <code>Update_Prepare().Prepare_End</code>, 准备下一波怪
</li>
<li>如果检查s都不是，跳转到下一个行动周期： eMainStep.OrderCheck
</li>
</ul>
</dd>

<dt> eMainStep.ToResult </dt><dd>战斗结束
<ul class="org-ul">
<li>返回 eMode.BattleFinished 使 SystemUpdate 进入空循环
</li>
</ul>
</dd>
</dl>

<p>
本轮人物被晕眩
</p>
<pre class="example">
---&gt; First ---&gt; OrderCheck ---&gt;  TurnSkipCheck ---&gt; TurnEnd ---&gt; OrderCheck --&gt; ... --&gt; ToResult
</pre>

<p>
本轮人物放技能
</p>
<pre class="example">
---&gt; First ---&gt; OrderCheck ---&gt;  TurnSkipCheck ---&gt; CommandInputStartCheck ---&gt; CommandExecute ---&gt; PostCommandExecute --&gt; StunCheck---&gt; TurnEnd ----&gt; OrderCheck --&gt; ... --&gt; ToResult   
</pre>

<p>
本轮人物放多人珍藏
</p>

<pre class="example">
---&gt; First ---&gt; OrderCheck ---&gt;  TurnSkipCheck ---&gt; CommandInputStartCheck ---&gt; TogetherAttackExecute_0 ---&gt; PostCommandExecute --&gt; TogetherAttackExecute_0 ---&gt; PostCommandExecute --&gt; StunCheck---&gt; TurnEnd ----&gt; OrderCheck --&gt; ... --&gt; ToResult   
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> BattleSystem: 实现</h2>
