krr.org
** 它应该有的样子，和它实际的样子

     #+BEGIN_VERSE
     
    整个战斗系统的设计本来应该一目了然， 就像上帝视角一样，或者像序列博弈(sequential game)那样：
    整个游戏有多少参与人(agents), 这些参与人有什么属性(生命值作为payoff),每个agents有个信息集和行动集(action set)，
    每轮根据信息集从中行动集选取一个行动，并由payoff function给出行动结果，直到游戏有人退出。

    在程序上所有信息和method被直接放到系统那，当做全局变量，方便来回调用
    换言之， 人物是一堆属性的集合， 它的行动要么等待用户输入，要么由系统给出，除开选择一个行动以外什么都不用做。
    伤害计算，行动值计算，属性相克，对方是否打晕等等作为信息集都是由系统更新给人物。
     
    #+END_VERSE
   ----------------------
     #+BEGIN_VERSE
     
    然而你游负责写人物(CharacterHandler)这个class的人，除开人物需要的属性以外，貌似还负责行动值的计算，眩晕的计算(CharacterBattle), AI的设计 (BattleAIData)等等工作，
    因为每项任务所需要的信息集不同导致有需要把人物外的信息塞到CharacterHandle里面来，导致信息集和设计十分混乱。

    例如晕眩的数值计算本身是什么都不需要的, 却被与其他状态，伤害计算 (BattleCommandParser)隔离开来。
     
    例如任何攻击的特效被放到SkillActionPlayer里，晕眩的却被塞到CharacterBattle里，以致于你在 [[*~BattleSystem.Update_Main()~][~BattleSystem.Update_Main()~]] 里单独看到检查晕眩的一段。
     
    例如行动值的计算。单人行动值的计算，完毕之后，还需要行动条(BattleOrder)去为每个行动值排序，于是还是需要外部在做一次工作。
     
    例如AI攻击的技能和技能释放对象的选择函数所需要信息集是巨大的，这里却是单人的信息集，所以它又几乎需要把所有信息放置进来(至少需要敌我组队信息)
    敌我组队信息 (BattlePartyData) 自身是一个人物集合， 然后又被放置到单个人物的信息内，而这种放置并不是指针的， 因为
    我们可以看到 [[*~BattleSystem.Update_Main()~][~BattleSystem.Update_Main()~]] 每一行动轮都重复着更新组队信息到每个人物的信息内。
    然而每一轮貌似又只有一个人物需要行动？

    这种设计的混乱加上人性的懒惰，导致不同程序员的互相引用泛滥（理论下层不该调用上层函数，感谢C#吧, 好的C#没有上下层， 我看你编译器能多吊）
    当某个函数把某属性交给下一个函数处理时，充斥着反复在组队成员中循环找寻Owner的工作， 亦或者是
    某位程序员中在一个函数中加一个判定做了safe check，
    另外一个程序员(也许可能就是他自己)直接利用这个safe check无所顾忌的做了个循环把所有人物扔了进去，而不是将他轻松就知道的人物进行直接调用
   
    结果就是: 现在的这个(CharacterHandler)复杂而且功能繁多 （呵呵哈哈哈或或或或或或或或或
     
    #+END_VERSE

 -----------------------
      #+BEGIN_QUOTE
      
      我发誓我只吐槽这一次

       #+END_QUOTE

 
** 约定俗成

   | 中文 | 英文    | 出处                     | 解释                                    |
   |------+---------+--------------------------+-----------------------------------------|
   | 命令 | command | BattleCommandData        | 包含普攻，技能，珍藏，奇拉拉技能        |
   | 位置 | join    | BattleDefine.eJoinMember | 包含     屏幕1,2,3位，板凳1,2位，好友位 |




   
** 人物.CharacterHandler

** 组队.BattlePartyData    


    
** 行动条.BattleOrder
   
*** 被调用的时机 (只考虑改变行动条的情形)
    - 当每一波怪刚进场初始化时，[[*~BattleSystem.Update_Prepare()~][~BattleSystem.Update_Prepare()~]] 进行到 ePrepareStep.End 会调用 ~BattleSystem.SetupWaveData(int waveindex)~ 函数进行初始化， 主要的工作就是初始行动条的初始化;
    - 手动嫖别人老婆和替换替补老婆的时候,替换掉行动条第一个人,ordervalue=0: ~BattleSystem.ChangePlayerJoinMemberOnInterruputFriend()~ 
    - 自动死亡时，新上来的人继承原有的死人的OrderValue:  ~BattleSystem.CalcAutoMemberChange()~ 中的一句 ~item.m_OrderValue = deadCharaData3.m_OrderValue~
    - 当别人老婆嫖的次数到了之后,如果替换的老婆没死，就继承原来的行动条单元,如果死了(理论上不会出现),删除该单元: ~BattleSystem.ChangePlayerJoinMemberOnGoBackFriend()~
      + 一通操作之后先检查死亡，再检查别人老婆次数是否到了，然后就是晕眩 ~eMainStep.PostCommandExecute~
    - 每轮的操作对己方的行动条影响
      + 单次命令
      + 集体珍藏
    - 每轮操作对敌方的行动条影响
      + 普通人遭到晕眩
      + 弱者遭到晕眩

*** 行动条的结构 
    1. 行动条上的单元.BattleOrder.FrameData (~m_Frames~): 
       - 单元类型.eFrameType: 轮到人或怪(Chara) 还是技能(Card)来执行本轮操作, 技能(Card)诸如3轮加血包，boss的攻击包等, 也被视作行动条上的一个单元
       - 行动值.OrderValue
       - 所有人.owner:  人或怪(Chara)就是自身，技能(Card)就是技能包的释放者
       - 技能包(Card).CardArguments: 技能包的具体信息， 如果是Chara，这里赋值是NULL
	 + ~m_AliveNum~
	 + ~m_RefID~
	 + ~m_CommandIndexWasCreated~
	 + ~BattleCommandData.m_Command~
	 + [[file:type.html::9][技能的种类.eSkillContentType]]: Card的技能种类:攻击，治疗等等，它甚至是来源于 ~.m_Command~ 的数据
    
    2. 行动值的特殊跳跃.BattleOrder.TogetherData (~m_TogetherData~): 同时释放珍藏会造成某个行动单元进行非常规跳跃
       - ~m_JoinOrder~ (List<BattleDefine.eJoinMember>): 它包含了要进行释放珍藏的人以及顺序

    3. 集体释放珍藏的最大次数: BattleTogetherGauge: (~m_Gauge~), 由珍藏条储能次数给出： 0, 1 , 2 ,3


*** 行动条的基本设定

    - 行动值的排序.BattleOrder.SortOrder(): 采用的是StableSort,同样行动值的前提下，原有位置保持不变，由行动值小到大排序, 大概因此(138比139快)
    - 行动值的更新.UpdateOrderValue(): 所有单位减去排第一的行动值, 如果<0，重置为0 （理论上不应该发生）, 这个会在 ~BattleSystem.Update_Main()~ 进行到 ~eMainStep.OrderCheck~ 时召唤 ~BattleSystem.TurnStartProcess()~ 调用
    - 集体释放珍藏的判定: 遇到第一个敌人,敌人释放的技能(Card)或者己方某个人物被判定状态异常(由CharacterBattle.CanBeTogetherAttack()定义:麻痹，沉默，睡眠，晕眩)就停止， 按顺序将人物放到TogetherData的list里，直到list里面的人数跟集体释放珍藏的最大次数的数目一样
       
    
*** 行动值的计算公式

    1. 算法. ~BattleCommandParser.CalcOrderValue(int spd, float loadFactor, float orderCoef)~
       
         #+BEGIN_SRC csharp
        	float num = BattleUtility.DefVal(eBattleDefineDB.OrderValueBaseMax);
		int num2 = (int)BattleUtility.DefVal(eBattleDefineDB.OrderValueDecreaseStart); // 
		if (spd >= num2)
		{
			int num3 = (spd - num2) / (int)BattleUtility.DefVal(eBattleDefineDB.OrderValueDecreaseInterval);
			num -= (float)(num3 + 1);
		}
		num = Mathf.Max(num, BattleUtility.DefVal(eBattleDefineDB.OrderValueBaseMin));
		float value = (float)(int)(num * loadFactor * orderCoef);
		return Mathf.Clamp(value, BattleUtility.DefVal(eBattleDefineDB.OrderValueMin), BattleUtility.DefVal(eBattleDefineDB.OrderValueMax));
       #+END_SRC

       - num 是初始基数，100， num2为初始基础最小值,50，具体的查询请看
       - 以给定spd=138为例 (结果与spd=139一样)
       - 首先这个值范围是[15,500] 之间. ([eBattleDefineDB.OrderValueMin ,eBattleDefineDB.OrderValueMax])
       - 速度基数一开始设置为 (eBattleDefineDB.OrderValueBaseMax)为 100.0,并且为浮点数
	 + 如果spd大于等于这个基数，就要对这个值进行调整为: (spd-50)/2并取整 ~(138-50)/2=44~, 再加一之后被100减去 ~100-(44+1)=55~ ,最终基数为55
	 + 如果小于这个判定，基数为100
       - 最终速度为 基数乘以后面两个乘数再取整

    2. 参数的一般调用情形 ~BattleCommandParser.CalcOrderValue(CharacterHandler charaHndl, BattleCommandData command)~
	
       - Spd 为建筑加成和好感度加成后的面板数据
       - LoadFactor: 初始化为1，
	 + 如果执行命令， 则这个值为该命令的 command.LoadFactor;
	 + 如果并没有执行命令，则检查是否深处睡眠状态，设这个值为2  这就是被晕眩时的情况 ~BattleSystem.TurnSkipProcess()~
       - orderCoef (statusBuffValue): 初始化为1，如果你身上叠了N层速度buff,每个buff都有一个Value(.Val)，这些buff.Val加总之后数值为Sum， 那么statusBuffValue的值最终是 Sum-N+1, [[(GetStatusBuffValue)][~BattleDefine.BuffStack.GetValue(true)~]]. 这个值不为0即可，为0则调整为1，但最终会被算法设置上下限
       
       
