krr.org
*** 初始化时的行动值计算
    
    - 对于双方屏幕三个位置,计算每个人的OrderValue: 
         #+BEGIN_SRC csharp
          BattleCommandParser.CalcOrderValue(member.CharaBattle.Param.FixedSpd(), 1f, 1f);
       #+END_SRC
      + 注意初始化的数据由 ~CharacterBattleParam.SetupParams(CharacterHandler owner, float[] townBuffParams)~ 给出
      + 注意这个FixedSpd()是面板数据，它会根据好感度，建筑等级 受到影响
	1. ~m_FixedBaseSpd = this.m_Owner.CharaParam.Spd;~   人物基础数据
	2. ~m_FixedBaseSpd = EditUtility.CalcParamCorrect(this.m_FixedBaseSpd, param2.m_CorrectSpd);~ 好感度加成
	3. ~m_FixedBaseSpd = EditUtility.CalcParamCorrect(this.m_FixedBaseSpd, this.m_TBuff[5]);~ 建筑物加成
	4. 最终这个 ~m_FixedBaseSpd~ 被确定为 ~CharaBattle.Param.FixedSpd()~
	5. CalcParamCorrect算法为, 注意 correct 为10, 137*1.1=150.7再向上取整变成151
            #+BEGIN_SRC csharp
		public static int CalcParamCorrect(int val, float correct)
		{
			float num = 1f + correct * 0.01f;
			return (int)Mathf.Ceil((float)val * num);
		}
	   #+END_SRC

    - 把所有人变成FrameData放到BattleSystem的BattleOrder里，顺序为先放我方三人，再放敌方三人, 因此根据[[*%E8%A1%8C%E5%8A%A8%E6%9D%A1%E7%9A%84%E5%9F%BA%E6%9C%AC%E8%AE%BE%E5%AE%9A][行动条基本设定]], 同等速度下，我方优先，然后位置优先

    

    


*** 单次命令的行动条变化
    1. Chara Type ~BattleCommandParser.UpdateOrder(BattleOrder battleOrder, int commandIndex, bool isUseUniqueSkill)~
       - 按照 ~BattleCommandParser.CalcOrderValue(owner, commandIndex, isUseUniqueSkill)~ 计算新的行动值
       - 并复制同样一个单元但是有新算好的orderValue重新排位到行动条上
		
    2. Card  Type  ~BattleCommandParser.UpdateOrder(BattleOrder battleOrder, int commandIndex, bool isUseUniqueSkill)~
       - Card的可使用次数-1
       - 如果Card的可使用次数仍然>0, 按照 ~BattleCommandParser.CalcOrderValue(owner.CharaBattle.Param.FixedSpd(), frameDataAt.m_CardArgs.m_Command.LoadFactor, 1f)~ 计算新的行动值
       - 注意到一来没有状态影响，二来，Card 行动值FixedSpd 继承于释放者的FixedSpd
       - 并复制同样一个单元但是有新算好的orderValue重新排位到行动条上
	 
    3. 最终在每轮把处理后的第一个单元去掉 ~BattleOrder.SlideFrames()~, 所以1,2步才能选择复制,否则会有重复	 
    
*** 集体珍藏的行动条变化
    - 由 ~UpdateOrderAfterTogetherAttack(BattleOrder battleOrder, List<CharacterHandler> togetherAttackedCharaHndls)~ 单独处理
    - 先从行动条里删除所有释放珍藏的单元
    - 分别计算orderValue: ~orderValue = BattleCommandParser.CalcOrderValue(togetherAttackedCharaHndls[k], -1, true)~  从这里提出珍藏command 再用算法
    - 再按珍藏释放顺序把释放单元逐一加回来，并赋予刚算好的orderValue ~battleOrder.AddFrameData(BattleOrder.eFrameType.Chara, togetherAttackedCharaHndls[k], orderValue, null)~
    - 这里根据基本设定，即使在两者ordervalue 一样时，释放珍藏顺序也改变了原有优先级

*** 敌方普通人遭到晕眩 ~BattleCommandParser.UpdateOrderOnStun(BattleOrder battleOrder)~
    - 判断敌人如果被晕眩，由施法者FixedSpd()和命令计算 num： ~num=BattleCommandParser.CalcOrderValue(owner, owner.CharaBattle.ExecCommand)~
    - 该敌人的orderValue加上 ~num * (BattleUtility.DefVal(eBattleDefineDB.StunAdditiveOrderValueRatioWhenStun) * 0.01f)~ (num*0.2)
    - 等价于原有 orderValue+num*1.2
    - 对行动条重新排序

*** 敌方弱者遭到晕眩
    - 在普通晕眩基础上加上 ~orderValue*(BattleUtility.DefVal(eBattleDefineDB.StunAdditiveOrderValueRatioWhenAttacked) * 0.01f)~ (num*0.5)
    - 等价于原有orderValue*1.5
    - 对行动条重新排序


		
** 伤害状态计算与绘制.SkillActionPlayer

   
** AI的实现.BattleAIParser

*** 概览
     #+BEGIN_VERSE
    先确定释放什么技能，再确定对谁释放
    #+END_VERSE

    
*** 被调用的时机
    
    [[*~BattleSystem.Update_Main()~][~BattleSystem.Update_Main()~]] 进行到 eMainStep.CommandInputStartCheck 等待指令输入时，
     会调用 BattleSystem.CommandInputStart()函数，如果判定本轮行动人是AI, 
     会调用 BattleSystem.CommandDecisionByAI()函数, 在指定行动AI人物owner后，
     会调用 BattleAIParser.SolveBattleAI(owner)函数, 并将结果储存到 BattleAISolveResult里。

     
*** 返回的结果.BattleAISolveResult
    
     它包括三个参数: 放什么技能， 对谁放， 技能是不是珍藏 
     
	- public int ~m_CommandIndex~ = -1;  // 命令index，最终命令在 ~owner.CharacterBattle.m_commands~ 里找到这个命令

	- public BattleDefine.eJoinMember ~m_TargetJoin~ = BattleDefine.eJoinMember.None; // 命令释放的对象的所处位置

	- public bool ~m_IsChargeSkill~;    // 这个技能需不需要充能, 即珍藏
   
   
*** 确定释放什么技能.SolveBattleAI
    
   1. 加载的AI命令集信息 ( ~BattleAIData~ ) 的构建: 
      - ( ~BattleAIExecData~ ) :  它包含一个 命令index（什么命令）， 一个比重 ( ~m_Ratio~ ), 是否按顺序选择对象 ~BattleAIExecData.isCommandTargetSelectionInOrder~ ， 一堆释放条件 和 一堆flag 
      - ( ~BattleAICommandData~ )： 一个 ~BattleAIExecData~ 的集合, 使用限制次数 ~m_ExecNum~ 以及 一堆条件 ~.m_Conditions~ 
      - ( ~BattleAIPatternData~ ) ： 一个 ~BattleAICommandData~ 的集合
      - ( ~BattleAIData~ ) ： 包含了一堆 ~BattleAIPatternData~ 以及如何切换他们的信息， 技能释放对象的最后选择顺序( ~m_SingleTargetPriorityWhenHateSame~ [[*%E5%8D%95%E4%BD%93%E4%BB%87%E6%81%A8%E4%B8%8E%E4%BB%87%E6%81%A8%E6%8E%92%E5%BA%8F.BattleAIHateResult][单体仇恨与仇恨排序.BattleAIHateResult]] 中的 ABC or CBA )

   2. 所以我们先找出来一个可用命令集 ~aiCommands[]~ 相当于 ~BattleAIPatternData~ 以供选择
      - 有珍藏可以放: ~BattleAIParser.SolveBattleAI_ChargeSkill~ ， 就只把珍藏放进 ~aiCommands[]~ 里
      - 没珍藏放技能: ~BattleAIParser.SolveBattleAI_Skill~ ， 从0开始在一堆 ~BattleAIPatternData~ 里选择一个满足切换条件的
	
   3. 然后我们再在 ~aiCommands[]~ 找到第一个满足下列两个条件的命令集 相当于 ~BattleAICommandData~ 以供选择: 
      - 命令集释放次数（ ~CharaBattle.GetAIExecedNum~ ）未达到限制 ( ~BattleAICommandData.m_ExecNum~ )
      - ai，ai技能可释放的对象满足 ( ~BattleAIParser.JudgeBattleAICommandConditions~ ) 命令集释放条件 ( ~BattleAICommandData.m_Conditions~ ) 
      - 如果
        + 一个都没有找到: 跳到 5
        + 找到一个命令集： 停止寻找（我们只需一个）， 跳到 4

   4. 最后我们需要在这个选定的命令集 ~BattleAICommandData~ 里随机挑出一个命令 ~BattleAIExecData~ 来:
      - 构建一个向量 array, 对应于 ~BattleAICommandData~ 里的各个 ~BattleAIExecData~
      - 把比重 ~BattleAIExecData.m_Ratio~ 加总， 然后对应array的位置计算比重/比重和， array 就是 比重的比重
      - 随机生成 0 到 1 中间的一个数字
      - 从第一个 array 的数值一直加加到 如果我们再加下一个数值就会超过这个随机数时停止， 返回下一个的index
      - 这个 index 指定的 ~BattleAIExecData~ 中所指定的 命令index 如果找得到就是我们要释放的技能
      - 如果找不到 跳到 5

   5. 释放 ai 可以释放的第一个命令，往往是普攻 ( ~CharacterHandler.CharaBattle.GetCommandDatas()[0]~ )

   6. 附注: 3 中的( ~BattleAIParser.JudgeBattleAICommandConditions~ ) 包含非常多的选项（我方敌方血线，异常状态，技能使用，存活数量，集体攻击，换人等等）， 所以 ( ~BattleAIData~ )可以设计的很通用

   7. 下一步： 我们需要根据选出来的技能算出仇恨（利用互克，血线，老弱病残等等）来选出技能释放对象
   
   
