krr.html


<div id="outline-container-sec-3-5-5" class="outline-4">
<h4 id="sec-3-5-5"><span class="section-number-4">3.5.5</span> 初始化时的行动值计算</h4>
<div class="outline-text-4" id="text-3-5-5">
<ul class="org-ul">
<li>对于双方屏幕三个位置,计算每个人的OrderValue: 
<div class="org-src-container">

<pre class="src src-csharp">BattleCommandParser.CalcOrderValue(member.CharaBattle.Param.FixedSpd(), 1f, 1f);
</pre>
</div>
<ul class="org-ul">
<li>注意初始化的数据由 <code>CharacterBattleParam.SetupParams(CharacterHandler owner, float[] townBuffParams)</code> 给出
</li>
<li>注意这个FixedSpd()是面板数据，它会根据好感度，建筑等级 受到影响
<ol class="org-ol">
<li><code>m_FixedBaseSpd = this.m_Owner.CharaParam.Spd;</code>   面板数据
</li>
<li><code>m_FixedBaseSpd = EditUtility.CalcParamCorrect(this.m_FixedBaseSpd, param2.m_CorrectSpd);</code> 好感度加成
</li>
<li><code>m_FixedBaseSpd = EditUtility.CalcParamCorrect(this.m_FixedBaseSpd, this.m_TBuff[5]);</code> 建筑物加成
</li>
<li>最终这个 <code>m_FixedBaseSpd</code> 被确定为 <code>CharaBattle.Param.FixedSpd()</code>
</li>
<li>CalcParamCorrect算法为, 注意 correct 为10, 137*1.1=150.7再向上取整变成151
<div class="org-src-container">

<pre class="src src-csharp"><span style="color: #F0DFAF; font-weight: bold;">public</span> <span style="color: #F0DFAF; font-weight: bold;">static</span> <span style="color: #7CB8BB;">int</span> <span style="color: #93E0E3;">CalcParamCorrect</span>(<span style="color: #7CB8BB;">int</span> <span style="color: #DFAF8F;">val</span>, <span style="color: #7CB8BB;">float</span> <span style="color: #DFAF8F;">correct</span>)
{
        <span style="color: #7CB8BB;">float</span> <span style="color: #DFAF8F;">num</span> = 1f + correct * 0.01f;
        <span style="color: #F0DFAF; font-weight: bold;">return</span> (<span style="color: #7CB8BB;">int</span>)Mathf.Ceil((<span style="color: #7CB8BB;">float</span>)val * num);
}
</pre>
</div>
</li>
</ol>
</li>
</ul>
</li>

<li>把所有人变成FrameData放到BattleSystem的BattleOrder里，顺序为先放我方三人，再放敌方三人, 因此根据<i>行动条基本设定</i>, 同等速度下，我方优先，然后位置优先
</li>
</ul>
</div>
</div>






<div id="outline-container-sec-3-5-6" class="outline-4">
<h4 id="sec-3-5-6"><span class="section-number-4">3.5.6</span> 单次命令的行动条变化</h4>
<div class="outline-text-4" id="text-3-5-6">
<ol class="org-ol">
<li>Chara Type <code>BattleCommandParser.UpdateOrder(BattleOrder battleOrder, int commandIndex, bool isUseUniqueSkill)</code>
<ul class="org-ul">
<li>按照 <code>BattleCommandParser.CalcOrderValue(owner, commandIndex, isUseUniqueSkill)</code> 计算新的行动值
</li>
<li>并复制同样一个单元但是有新算好的orderValue重新排位到行动条上
</li>
</ul>
</li>

<li>Card  Type  <code>BattleCommandParser.UpdateOrder(BattleOrder battleOrder, int commandIndex, bool isUseUniqueSkill)</code>
<ul class="org-ul">
<li>Card的可使用次数-1
</li>
<li>如果Card的可使用次数仍然&gt;0, 按照 <code>BattleCommandParser.CalcOrderValue(owner.CharaBattle.Param.FixedSpd(), frameDataAt.m_CardArgs.m_Command.LoadFactor, 1f)</code> 计算新的行动值
</li>
<li>注意到一来没有状态影响，二来，Card 行动值FixedSpd 继承于释放者的FixedSpd
</li>
<li>并复制同样一个单元但是有新算好的orderValue重新排位到行动条上
</li>
</ul>
</li>

<li>最终在每轮把处理后的第一个单元去掉 <code>BattleOrder.SlideFrames()</code>, 所以1,2步才能选择复制         
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-5-7" class="outline-4">
<h4 id="sec-3-5-7"><span class="section-number-4">3.5.7</span> 集体珍藏的行动条变化</h4>
<div class="outline-text-4" id="text-3-5-7">
<ul class="org-ul">
<li>由 <code>UpdateOrderAfterTogetherAttack(BattleOrder battleOrder, List&lt;CharacterHandler&gt; togetherAttackedCharaHndls)</code> 单独处理
</li>
<li>先从行动条里删除所有释放珍藏的单元
</li>
<li>分别计算orderValue: <code>orderValue = BattleCommandParser.CalcOrderValue(togetherAttackedCharaHndls[k], -1, true)</code>  从这里提出珍藏command 再用算法
</li>
<li>再按珍藏释放顺序把释放单元逐一加回来，并赋予刚算好的orderValue <code>battleOrder.AddFrameData(BattleOrder.eFrameType.Chara, togetherAttackedCharaHndls[k], orderValue, null)</code>
</li>
<li>这里根据基本设定，即使在两者ordervalue 一样时，释放珍藏顺序也改变了原有优先级
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-5-8" class="outline-4">
<h4 id="sec-3-5-8"><span class="section-number-4">3.5.8</span> 敌方普通人遭到晕眩 <code>BattleCommandParser.UpdateOrderOnStun(BattleOrder battleOrder)</code></h4>
<div class="outline-text-4" id="text-3-5-8">
<ul class="org-ul">
<li>判断敌人如果被晕眩，由施法者FixedSpd()和命令计算 num： <code>num=BattleCommandParser.CalcOrderValue(owner, owner.CharaBattle.ExecCommand)</code>
</li>
<li>该敌人的orderValue加上 <code>num * (BattleUtility.DefVal(eBattleDefineDB.StunAdditiveOrderValueRatioWhenStun) * 0.01f)</code> (num*0.2)
</li>
<li>等价于原有 orderValue+num*1.2
</li>
<li>对行动条重新排序
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-5-9" class="outline-4">
<h4 id="sec-3-5-9"><span class="section-number-4">3.5.9</span> 敌方弱者遭到晕眩</h4>
<div class="outline-text-4" id="text-3-5-9">
<ul class="org-ul">
<li>在普通晕眩基础上加上 <code>orderValue*(BattleUtility.DefVal(eBattleDefineDB.StunAdditiveOrderValueRatioWhenAttacked) * 0.01f)</code> (num*0.5)
</li>
<li>等价于原有orderValue*1.5
</li>
<li>对行动条重新排序
</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> 伤害状态计算与绘制.SkillActionPlayer</h3>
</div>


<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> AI的实现.BattleAIParser</h3>
<div class="outline-text-3" id="text-3-7">
</div><div id="outline-container-sec-3-7-1" class="outline-4">
<h4 id="sec-3-7-1"><span class="section-number-4">3.7.1</span> 概览</h4>
<div class="outline-text-4" id="text-3-7-1">
<p class="verse">
先确定释放什么技能，再确定对谁释放<br  />
</p>
</div>
</div>


<div id="outline-container-sec-3-7-2" class="outline-4">
<h4 id="sec-3-7-2"><span class="section-number-4">3.7.2</span> 被调用的时机</h4>
<div class="outline-text-4" id="text-3-7-2">
<p>
<a href="#sec-2-3"><code>BattleSystem.Update_Main()</code></a> 进行到 eMainStep.CommandInputStartCheck 等待指令输入时，
 会调用 BattleSystem.CommandInputStart()函数，如果判定本轮行动人是AI, 
 会调用 BattleSystem.CommandDecisionByAI()函数, 在指定行动AI人物owner后，
 会调用 BattleAIParser.SolveBattleAI(owner)函数, 并将结果储存到 BattleAISolveResult里。
</p>
</div>
</div>


<div id="outline-container-sec-3-7-3" class="outline-4">
<h4 id="sec-3-7-3"><span class="section-number-4">3.7.3</span> 返回的结果.BattleAISolveResult</h4>
<div class="outline-text-4" id="text-3-7-3">
<p>
它包括三个参数: 放什么技能， 对谁放， 技能是不是珍藏 
</p>

<ul class="org-ul">
<li>public int <code>m_CommandIndex</code> = -1;  // 命令index，最终命令在 <code>owner.CharacterBattle.m_commands</code> 里找到这个命令
</li>

<li>public BattleDefine.eJoinMember <code>m_TargetJoin</code> = BattleDefine.eJoinMember.None; // 命令释放的对象的所处位置
</li>

<li>public bool <code>m_IsChargeSkill</code>;    // 这个技能需不需要充能, 即珍藏
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-7-4" class="outline-4">
<h4 id="sec-3-7-4"><span class="section-number-4">3.7.4</span> 确定释放什么技能.SolveBattleAI</h4>
<div class="outline-text-4" id="text-3-7-4">
<ol class="org-ol">
<li>加载的AI命令集信息 ( <code>BattleAIData</code> ) 的构建: 
<ul class="org-ul">
<li>( <code>BattleAIExecData</code> ) :  它包含一个 命令index（什么命令）， 一个比重 ( <code>m_Ratio</code> ), 是否按顺序选择对象 <code>BattleAIExecData.isCommandTargetSelectionInOrder</code> ， 一堆释放条件 和 一堆flag 
</li>
<li>( <code>BattleAICommandData</code> )： 一个 <code>BattleAIExecData</code> 的集合, 使用限制次数 <code>m_ExecNum</code> 以及 一堆条件 <code>.m_Conditions</code> 
</li>
<li>( <code>BattleAIPatternData</code> ) ： 一个 <code>BattleAICommandData</code> 的集合
</li>
<li>( <code>BattleAIData</code> ) ： 包含了一堆 <code>BattleAIPatternData</code> 以及如何切换他们的信息， 技能释放对象的最后选择顺序( <code>m_SingleTargetPriorityWhenHateSame</code> <i>单体仇恨与仇恨排序.BattleAIHateResult</i> 中的 ABC or CBA )
</li>
</ul>
</li>

<li>所以我们先找出来一个可用命令集 <code>aiCommands[]</code> 相当于 <code>BattleAIPatternData</code> 以供选择
<ul class="org-ul">
<li>有珍藏可以放: <code>BattleAIParser.SolveBattleAI_ChargeSkill</code> ， 就只把珍藏放进 <code>aiCommands[]</code> 里
</li>
<li>没珍藏放技能: <code>BattleAIParser.SolveBattleAI_Skill</code> ， 从0开始在一堆 <code>BattleAIPatternData</code> 里选择一个满足切换条件的
</li>
</ul>
</li>

<li>然后我们再在 <code>aiCommands[]</code> 找到第一个满足下列两个条件的命令集 相当于 <code>BattleAICommandData</code> 以供选择: 
<ul class="org-ul">
<li>命令集释放次数（ <code>CharaBattle.GetAIExecedNum</code> ）未达到限制 ( <code>BattleAICommandData.m_ExecNum</code> )
</li>
<li>ai，ai技能可释放的对象满足 ( <code>BattleAIParser.JudgeBattleAICommandConditions</code> ) 命令集释放条件 ( <code>BattleAICommandData.m_Conditions</code> ) 
</li>
<li>如果
<ul class="org-ul">
<li>一个都没有找到: 跳到 5
</li>
<li>找到一个命令集： 停止寻找（我们只需一个）， 跳到 4
</li>
</ul>
</li>
</ul>
</li>

<li>最后我们需要在这个选定的命令集 <code>BattleAICommandData</code> 里随机挑出一个命令 <code>BattleAIExecData</code> 来:
<ul class="org-ul">
<li>构建一个向量 array, 对应于 <code>BattleAICommandData</code> 里的各个 <code>BattleAIExecData</code>
</li>
<li>把比重 <code>BattleAIExecData.m_Ratio</code> 加总， 然后对应array的位置计算比重/比重和， array 就是 比重的比重
</li>
<li>随机生成 0 到 1 中间的一个数字
</li>
<li>从第一个 array 的数值一直加加到 如果我们再加下一个数值就会超过这个随机数时停止， 返回下一个的index
</li>
<li>这个 index 指定的 <code>BattleAIExecData</code> 中所指定的 命令index 如果找得到就是我们要释放的技能
</li>
<li>如果找不到 跳到 5
</li>
</ul>
</li>

<li>释放 ai 可以释放的第一个命令，往往是普攻 ( <code>CharacterHandler.CharaBattle.GetCommandDatas()[0]</code> )
</li>

<li>附注: 3 中的( <code>BattleAIParser.JudgeBattleAICommandConditions</code> ) 包含非常多的选项（我方敌方血线，异常状态，技能使用，存活数量，集体攻击，换人等等）， 所以 ( <code>BattleAIData</code> )可以设计的很通用
</li>

<li>下一步： 我们需要根据选出来的技能算出仇恨（利用互克，血线，老弱病残等等）来选出技能释放对象
</li>
</ol>
</div>
</div>
