krr.org
*** 施放对象的构建

   1. 我们先根据是对敌方放还是己方放，把可以释放的对象找出来放到list里， 这个list是按站位排序的，我们会在 确定该技能释放的对象.SolveTargetJoinFromHateResults中发现，条件完全一样时是会选择第一个，所以这一步很重要。
   2. 如果释放对象只有一个的话就是他了，如果释放对象是全体我们就不用算了
   3. 如果还要求 ~BattleAIExecData.isCommandTargetSelectionInOrder~ 就要考虑是否要加入仇恨吸引因素， 毕竟骑士技能和你忍叔可以拉仇恨 ( ~CharaBattle.Param.GetHateChangeValue()~ )
      - 这个值都>0的只有一个那就是它了， 跳过后面所有计算
      - 这个值都=0的只有一个那就是它了， 跳过后面所有计算
      - 这个值都=0的有很多个那么从 上次技能使用位置 ( ~CharaBattle.GetOldSingleTargetIndex(commandData.MainSkillTargetType)~ )的下一个位置开始 （0->1->2->0）,这个值都=0的谁第一个在这个位置上就选谁， 跳过后面所有计算
      - 这个值>0的有多个那么在他们中间开始计算仇恨
      - 如果全<0 对初始list开始计算仇恨
	   


*** 状态仇恨的计算.CalcHitSingleConditionCount

   - 如果要求 ~BattleAIExecData.isCommandTargetSelectionInOrder~ 就不用算了， ~m_HitSingleConditionCount =0~

   - 否则进行五个状态的判断:
     
     + ~是不是要死了.Judge_Dying~

     + ~是不是某特定属性.Judge_Element~

     + ~属性是否克制.Judge_WeakElement~

     + ~是不是某特定职业.Judge_Class~

     + ~是否落入不正常状态.Judge_StateAbnormal~

   - 加总.CalcHitSingleConditionCount : ~m_HitSingleConditionCount = [ 0,  5 ]~
   

*** 单体(target)伤害仇恨的计算.BattleAIParser.SolveTargetJoin
  1. 在eBattleDefineDB.HateValueMin 与 HateValueMin.HateValueMax+1 之间生成一个随机数, 复制给 ~m_HateValue~
  2. ~m_HateValue *= ( 1f + target.Param.HateChangeValue)~
  3. ~m_HateValue += (float)((eBattleDefineDB.HateAIConditionCoef) * .m_HitSingleConditionCount)~ 
  4. 如果你是屏幕上第一个位置（join）的人的话，不好意思还要
     ~m_HateValue += BattleUtility.DefVal(eBattleDefineDB.HateValueJoin1)~

*** 单体仇恨与仇恨排序.BattleAIHateResult   
	
    - 它包括三个参数: 谁，伤害仇恨，状态仇恨
     
      + public BattleDefine.eJoinMember  ~m_Join~;  // 计算仇恨时该单体位置
   
      + public float ~m_HateValue~;  // 伤害仇恨 

      + public int ~m_HitSingleConditionCount~; // 状态仇恨： 计算满足哪几个不好的状态的，谁不好的状态最多
   
    - 排序: 如何判断谁比谁更可恨   
      + BattleAIParser.CompareHateResult: 伤害仇恨越高，谁更可恨，同等伤害仇恨，谁状态仇恨越高越可恨
      + 若仍然相同 请选择  ~CompareHateResult_JoinABC~ （ ~CompareHateResult_JoinCBA~ ） ： 谁的位置更靠前（后）更可恨


    


   


*** 确定该技能释放的对象.SolveTargetJoinFromHateResults	
      - 我们算出所有对象的单体仇恨
      - 我们按照单体仇恨与仇恨排序来算出最可恨的人（嘤嘤嘤）
      - 如果统统一样可恨就选第一个当释放对象
      - 如果不一样，但最可恨的有多个就看 ~m_SingleTargetPriorityWhenHateSame~ 是 ~CompareHateResult_JoinABC~ 还是 ~CompareHateResult_JoinCBA~ 按位置排序完来选了

 


   
** 实现.BattleSystem
** 不会怎么提的数据导入.BattleSystemData

** 不会怎么提的人机交互.BattleInputData

** 不会怎么提的多媒体效果实现.XScene


		

