krr.html


<div id="outline-container-sec-3-7-5" class="outline-4">
<h4 id="sec-3-7-5"><span class="section-number-4">3.7.5</span> 施放对象的构建</h4>
<div class="outline-text-4" id="text-3-7-5">
<ol class="org-ol">
<li>我们先根据是对敌方放还是己方放，把可以释放的对象找出来放到list里， 这个list是按站位排序的，我们会在 确定该技能释放的对象.SolveTargetJoinFromHateResults中发现，条件完全一样时是会选择第一个，所以这一步很重要。
</li>
<li>如果释放对象只有一个的话就是他了，如果释放对象是全体我们就不用算了
</li>
<li>如果还要求 <code>BattleAIExecData.isCommandTargetSelectionInOrder</code> 就要考虑是否要加入仇恨吸引因素， 毕竟骑士技能和你忍叔可以拉仇恨 ( <code>CharaBattle.Param.GetHateChangeValue()</code> )
<ul class="org-ul">
<li>这个值都&gt;0的只有一个那就是它了， 跳过后面所有计算
</li>
<li>这个值都=0的只有一个那就是它了， 跳过后面所有计算
</li>
<li>这个值都=0的有很多个那么从 上次技能使用位置 ( <code>CharaBattle.GetOldSingleTargetIndex(commandData.MainSkillTargetType)</code> )的下一个位置开始 （0-&gt;1-&gt;2-&gt;0）,这个值都=0的谁第一个在这个位置上就选谁， 跳过后面所有计算
</li>
<li>这个值&gt;0的有多个那么在他们中间开始计算仇恨
</li>
<li>如果全&lt;0 对初始list开始计算仇恨
</li>
</ul>
</li>
</ol>
</div>
</div>



<div id="outline-container-sec-3-7-6" class="outline-4">
<h4 id="sec-3-7-6"><span class="section-number-4">3.7.6</span> 状态仇恨的计算.CalcHitSingleConditionCount</h4>
<div class="outline-text-4" id="text-3-7-6">
<ul class="org-ul">
<li>如果要求 <code>BattleAIExecData.isCommandTargetSelectionInOrder</code> 就不用算了， <code>m_HitSingleConditionCount =0</code>
</li>

<li>否则进行五个状态的判断:

<ul class="org-ul">
<li><code>是不是要死了.Judge_Dying</code>
</li>

<li><code>是不是某特定属性.Judge_Element</code>
</li>

<li><code>属性是否克制.Judge_WeakElement</code>
</li>

<li><code>是不是某特定职业.Judge_Class</code>
</li>

<li><code>是否落入不正常状态.Judge_StateAbnormal</code>
</li>
</ul>
</li>

<li>加总.CalcHitSingleConditionCount : <code>m_HitSingleConditionCount = [ 0,  5 ]</code>
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-3-7-7" class="outline-4">
<h4 id="sec-3-7-7"><span class="section-number-4">3.7.7</span> 单体(target)伤害仇恨的计算.BattleAIParser.SolveTargetJoin</h4>
<div class="outline-text-4" id="text-3-7-7">
<ol class="org-ol">
<li>在eBattleDefineDB.HateValueMin 与 HateValueMin.HateValueMax+1 之间生成一个随机数, 复制给 <code>m_HateValue</code>
</li>
<li><code>m_HateValue *= ( 1f + target.Param.HateChangeValue)</code>
</li>
<li><code>m_HateValue += (float)((eBattleDefineDB.HateAIConditionCoef) * .m_HitSingleConditionCount)</code> 
</li>
<li>如果你是屏幕上第一个位置（join）的人的话，不好意思还要
<code>m_HateValue += BattleUtility.DefVal(eBattleDefineDB.HateValueJoin1)</code>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3-7-8" class="outline-4">
<h4 id="sec-3-7-8"><span class="section-number-4">3.7.8</span> 单体仇恨与仇恨排序.BattleAIHateResult</h4>
<div class="outline-text-4" id="text-3-7-8">
<ul class="org-ul">
<li>它包括三个参数: 谁，伤害仇恨，状态仇恨

<ul class="org-ul">
<li>public BattleDefine.eJoinMember  <code>m_Join</code>;  // 计算仇恨时该单体位置
</li>

<li>public float <code>m_HateValue</code>;  // 伤害仇恨 
</li>

<li>public int <code>m_HitSingleConditionCount</code>; // 状态仇恨： 计算满足哪几个不好的状态的，谁不好的状态最多
</li>
</ul>
</li>

<li>排序: 如何判断谁比谁更可恨   
<ul class="org-ul">
<li>BattleAIParser.CompareHateResult: 伤害仇恨越高，谁更可恨，同等伤害仇恨，谁状态仇恨越高越可恨
</li>
<li>若仍然相同 请选择  <code>CompareHateResult_JoinABC</code> （ <code>CompareHateResult_JoinCBA</code> ） ： 谁的位置更靠前（后）更可恨
</li>
</ul>
</li>
</ul>
</div>
</div>








<div id="outline-container-sec-3-7-9" class="outline-4">
<h4 id="sec-3-7-9"><span class="section-number-4">3.7.9</span> 确定该技能释放的对象.SolveTargetJoinFromHateResults</h4>
<div class="outline-text-4" id="text-3-7-9">
<ul class="org-ul">
<li>我们算出所有对象的单体仇恨
</li>
<li>我们按照单体仇恨与仇恨排序来算出最可恨的人（嘤嘤嘤）
</li>
<li>如果统统一样可恨就选第一个当释放对象
</li>
<li>如果不一样，但最可恨的有多个就看 <code>m_SingleTargetPriorityWhenHateSame</code> 是 <code>CompareHateResult_JoinABC</code> 还是 <code>CompareHateResult_JoinCBA</code> 按位置排序完来选了
</li>
</ul>
</div>
</div>
</div>





<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> 实现.BattleSystem</h3>
</div>
<div id="outline-container-sec-3-9" class="outline-3">
<h3 id="sec-3-9"><span class="section-number-3">3.9</span> 不会怎么提的数据导入.BattleSystemData</h3>
</div>

<div id="outline-container-sec-3-10" class="outline-3">
<h3 id="sec-3-10"><span class="section-number-3">3.10</span> 不会怎么提的人机交互.BattleInputData</h3>
</div>

<div id="outline-container-sec-3-11" class="outline-3">
<h3 id="sec-3-11"><span class="section-number-3">3.11</span> 不会怎么提的多媒体效果实现.XScene</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: yuanchuan cao</p>
<p class="date">Created: 2018-06-08 五 15:43</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
